src/test/resources/plays/multipayment/cancel_pre_authorized.yaml

!play
interactions:
-
  request:
    uri: /v2/multipayments/MPY-YDNM3U17OSDD/void
    headers:
      "Content-Type": application/json
      Authorization: Basic MDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDE6QUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQg==
    method: POST
  response:
    status: 200
    headers:
      "Content-Type": application/json
    body: |
      {"id":"MPY-YDNM3U17OSDD","status":"CANCELLED","amount":{"total":8000,"gross":8000,"currency":"BRL"},"installmentCount":1,"payments":[{"id":"PAY-QVDIEWUXS63X","status":"CANCELLED","delayCapture":true,"cancellationDetails":{"code":"7","description":"Política do Moip","cancelledBy":"MOIP"},"amount":{"total":4000,"gross":4000,"fees":289,"refunds":0,"liquid":3711,"currency":"BRL"},"installmentCount":1,"fundingInstrument":{"creditCard":{"id":"CRC-UARTCOXFHAQI","brand":"VISA","first6":"401200","last4":"1112","store":true,"holder":{"birthdate":"1988-12-30","birthDate":"1988-12-30","taxDocument":{"type":"CPF","number":"22222222222"},"fullname":"Jose Portador da Silva"}},"method":"CREDIT_CARD"},"fees":[{"type":"TRANSACTION","amount":289}],"escrows":[{"id":"ECW-IYMNMWOWNLPE","status":"HOLD_PENDING","description":"Teste","amount":4000,"createdAt":"2017-10-03T16:15:01.000-03","updatedAt":"2017-10-03T16:15:01.000-03","_links":{"self":{"href":"https://sandbox.moip.com.br/v2/escrows/ECW-IYMNMWOWNLPE"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-JXXOQ5UZDIPT","title":"ORD-JXXOQ5UZDIPT"},"payment":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-QVDIEWUXS63X","title":"PAY-QVDIEWUXS63X"}}}],"events":[{"type":"PAYMENT.CANCELLED","createdAt":"2017-10-03T16:15:30.744-03"},{"type":"PAYMENT.CREATED","createdAt":"2017-10-03T16:15:01.000-03"},{"type":"PAYMENT.IN_ANALYSIS","createdAt":"2017-10-03T16:15:01.000-03"},{"type":"PAYMENT.WAITING","createdAt":"2017-10-03T16:15:01.000-03"},{"type":"PAYMENT.PRE_AUTHORIZED","createdAt":"2017-10-03T16:15:01.000-03"}],"receivers":[{"moipAccount":{"id":"MPA-E3C9493A06AE","login":"test2@moip.com.br","fullname":"Moip Test2"},"type":"PRIMARY","amount":{"total":3500,"refunds":0}},{"moipAccount":{"id":"MPA-8D5DCB4EF8B8","login":"test@moip.com.br","fullname":"Moip Test"},"type":"SECONDARY","amount":{"total":500,"fees":0,"refunds":0},"feePayor":false}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-QVDIEWUXS63X"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-JXXOQ5UZDIPT","title":"ORD-JXXOQ5UZDIPT"}},"createdAt":"2017-10-03T16:15:01.000-03","updatedAt":"2017-10-03T16:15:30.743-03"},{"id":"PAY-Z56NGYZIGWLS","status":"CANCELLED","delayCapture":true,"cancellationDetails":{"code":"7","description":"Política do Moip","cancelledBy":"MOIP"},"amount":{"total":4000,"gross":4000,"fees":289,"refunds":0,"liquid":3711,"currency":"BRL"},"installmentCount":1,"fundingInstrument":{"creditCard":{"id":"CRC-UARTCOXFHAQI","brand":"VISA","first6":"401200","last4":"1112","store":true,"holder":{"birthdate":"1988-12-30","birthDate":"1988-12-30","taxDocument":{"type":"CPF","number":"22222222222"},"fullname":"Jose Portador da Silva"}},"method":"CREDIT_CARD"},"fees":[{"type":"TRANSACTION","amount":289}],"escrows":[{"id":"ECW-36HP0I3XS88K","status":"HOLD_PENDING","description":"Teste","amount":4000,"createdAt":"2017-10-03T16:15:01.000-03","updatedAt":"2017-10-03T16:15:01.000-03","_links":{"self":{"href":"https://sandbox.moip.com.br/v2/escrows/ECW-36HP0I3XS88K"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-KHE8B9HCYRGG","title":"ORD-KHE8B9HCYRGG"},"payment":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-Z56NGYZIGWLS","title":"PAY-Z56NGYZIGWLS"}}}],"events":[{"type":"PAYMENT.CANCELLED","createdAt":"2017-10-03T16:15:30.745-03"},{"type":"PAYMENT.CREATED","createdAt":"2017-10-03T16:15:01.000-03"},{"type":"PAYMENT.IN_ANALYSIS","createdAt":"2017-10-03T16:15:01.000-03"},{"type":"PAYMENT.WAITING","createdAt":"2017-10-03T16:15:01.000-03"},{"type":"PAYMENT.PRE_AUTHORIZED","createdAt":"2017-10-03T16:15:01.000-03"}],"receivers":[{"moipAccount":{"id":"MPA-8D5DCB4EF8B8","login":"test@moip.com.br","fullname":"Moip Test"},"type":"PRIMARY","amount":{"total":4000,"refunds":0}}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-Z56NGYZIGWLS"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-KHE8B9HCYRGG","title":"ORD-KHE8B9HCYRGG"}},"createdAt":"2017-10-03T16:15:01.000-03","updatedAt":"2017-10-03T16:15:30.744-03"}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/multipayments/MPY-YDNM3U17OSDD"},"multiorder":{"href":"https://sandbox.moip.com.br/v2/multiorders/MOR-EKNI6LTAGTL2"}}}