src/test/resources/plays/multipayment/capture.yaml

!play
interactions:
-
  request:
    uri: /v2/multipayments/MPY-UGZLJMVJ37LX/capture
    headers:
      "Content-Type": application/json
      Authorization: Basic MDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDE6QUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQg==
    method: POST
  response:
    status: 200
    headers:
      "Content-Type": application/json
    body: |
      {"id":"MPY-UGZLJMVJ37LX","status":"AUTHORIZED","amount":{"total":8000,"gross":8000,"currency":"BRL"},"installmentCount":1,"payments":[{"id":"PAY-9GG93Z35GIL9","status":"AUTHORIZED","delayCapture":true,"amount":{"total":4000,"gross":4000,"fees":289,"refunds":0,"liquid":3711,"currency":"BRL"},"installmentCount":1,"fundingInstrument":{"creditCard":{"id":"CRC-UARTCOXFHAQI","brand":"VISA","first6":"401200","last4":"1112","store":true,"holder":{"birthdate":"1988-12-30","birthDate":"1988-12-30","taxDocument":{"type":"CPF","number":"22222222222"},"fullname":"Jose Portador da Silva"}},"method":"CREDIT_CARD"},"fees":[{"type":"TRANSACTION","amount":289}],"escrows":[{"id":"ECW-WJXZOH0PNEMW","status":"HOLD_PENDING","description":"Teste","amount":4000,"createdAt":"2017-10-03T14:08:58.000-03","updatedAt":"2017-10-03T14:08:58.000-03","_links":{"self":{"href":"https://sandbox.moip.com.br/v2/escrows/ECW-WJXZOH0PNEMW"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-AKHZSK8LS19F","title":"ORD-AKHZSK8LS19F"},"payment":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-9GG93Z35GIL9","title":"PAY-9GG93Z35GIL9"}}}],"events":[{"type":"PAYMENT.AUTHORIZED","createdAt":"2017-10-03T14:09:19.983-03"},{"type":"PAYMENT.CREATED","createdAt":"2017-10-03T14:08:58.000-03"},{"type":"PAYMENT.IN_ANALYSIS","createdAt":"2017-10-03T14:08:58.000-03"},{"type":"PAYMENT.WAITING","createdAt":"2017-10-03T14:08:58.000-03"},{"type":"PAYMENT.PRE_AUTHORIZED","createdAt":"2017-10-03T14:08:58.000-03"}],"receivers":[{"moipAccount":{"id":"MPA-E3C9493A06AE","login":"test2@moip.com.br","fullname":"Moip Test2"},"type":"PRIMARY","amount":{"total":3500,"refunds":0}},{"moipAccount":{"id":"MPA-8D5DCB4EF8B8","login":"test@moip.com.br","fullname":"Moip Test"},"type":"SECONDARY","amount":{"total":500,"fees":0,"refunds":0},"feePayor":false}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-9GG93Z35GIL9"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-AKHZSK8LS19F","title":"ORD-AKHZSK8LS19F"}},"createdAt":"2017-10-03T14:08:58.000-03","updatedAt":"2017-10-03T14:09:19.978-03"},{"id":"PAY-T0GZIGY9UZ32","status":"AUTHORIZED","delayCapture":true,"amount":{"total":4000,"gross":4000,"fees":289,"refunds":0,"liquid":3711,"currency":"BRL"},"installmentCount":1,"fundingInstrument":{"creditCard":{"id":"CRC-UARTCOXFHAQI","brand":"VISA","first6":"401200","last4":"1112","store":true,"holder":{"birthdate":"1988-12-30","birthDate":"1988-12-30","taxDocument":{"type":"CPF","number":"22222222222"},"fullname":"Jose Portador da Silva"}},"method":"CREDIT_CARD"},"fees":[{"type":"TRANSACTION","amount":289}],"escrows":[{"id":"ECW-78UXUWN40EH7","status":"HOLD_PENDING","description":"Teste","amount":4000,"createdAt":"2017-10-03T14:08:58.000-03","updatedAt":"2017-10-03T14:08:58.000-03","_links":{"self":{"href":"https://sandbox.moip.com.br/v2/escrows/ECW-78UXUWN40EH7"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-SYIZEXS47ZSK","title":"ORD-SYIZEXS47ZSK"},"payment":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-T0GZIGY9UZ32","title":"PAY-T0GZIGY9UZ32"}}}],"events":[{"type":"PAYMENT.AUTHORIZED","createdAt":"2017-10-03T14:09:19.984-03"},{"type":"PAYMENT.CREATED","createdAt":"2017-10-03T14:08:58.000-03"},{"type":"PAYMENT.IN_ANALYSIS","createdAt":"2017-10-03T14:08:58.000-03"},{"type":"PAYMENT.WAITING","createdAt":"2017-10-03T14:08:58.000-03"},{"type":"PAYMENT.PRE_AUTHORIZED","createdAt":"2017-10-03T14:08:58.000-03"}],"receivers":[{"moipAccount":{"id":"MPA-8D5DCB4EF8B8","login":"test@moip.com.br","fullname":"Moip Test"},"type":"PRIMARY","amount":{"total":4000,"refunds":0}}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-T0GZIGY9UZ32"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-SYIZEXS47ZSK","title":"ORD-SYIZEXS47ZSK"}},"createdAt":"2017-10-03T14:08:58.000-03","updatedAt":"2017-10-03T14:09:19.983-03"}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/multipayments/MPY-UGZLJMVJ37LX"},"multiorder":{"href":"https://sandbox.moip.com.br/v2/multiorders/MOR-UVC9O3PH7DIU"}}}