src/test/resources/plays/multipayment/create_boleto.yaml

!play
interactions:
-
  request:
    uri: /v2/multiorders/MOR-F2R675R1X97P/multipayments
    headers:
      "Content-Type": application/json
      Authorization: Basic MDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDE6QUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQg==
    method: POST
  response:
    status: 200
    headers:
      "Content-Type": application/json
    body: |
      {"id":"MPY-VVVF0YDCY15H","status":"WAITING","amount":{"total":8000,"gross":8000,"currency":"BRL"},"installmentCount":1,"fundingInstrument":{"boleto":{"expirationDate":"2017-09-30","lineCode":"23793.39126 60000.123798 56001.747908 1 72980000004000","logoUri":"http://","instructionLines":{"first":"Primeira linha se instrução","second":"Segunda linha se instrução","third":"Terceira linha se instrução"}},"method":"BOLETO"},"payments":[{"id":"PAY-SA9BQ8ZKTBYG","status":"WAITING","delayCapture":false,"amount":{"total":4000,"gross":4000,"fees":0,"refunds":0,"liquid":4000,"currency":"BRL"},"installmentCount":1,"fundingInstrument":{"boleto":{"expirationDate":"2017-09-30","lineCode":"23793.39126 60000.123798 56001.747908 1 72980000004000","logoUri":"http://","instructionLines":{"first":"Primeira linha se instrução","second":"Segunda linha se instrução","third":"Terceira linha se instrução"}},"method":"BOLETO"},"fees":[{"type":"TRANSACTION","amount":0}],"events":[{"type":"PAYMENT.CREATED","createdAt":"2017-08-25T14:21:18.000-03"},{"type":"PAYMENT.WAITING","createdAt":"2017-08-25T14:21:18.000-03"}],"receivers":[{"moipAccount":{"id":"MPA-321321321","login":"teste2@moip.com.br","fullname":"Test2 Moip"},"type":"PRIMARY","amount":{"total":3500,"refunds":0}},{"moipAccount":{"id":"MPA-123123123","login":"test@moip.com.br","fullname":"Test Moip"},"type":"SECONDARY","amount":{"total":500,"fees":0,"refunds":0},"feePayor":false}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-SA9BQ8ZKTBYG"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-7JY09V7SHR5J","title":"ORD-7JY09V7SHR5J"}},"createdAt":"2017-08-25T14:21:18.000-03","updatedAt":"2017-08-25T14:21:18.000-03"},{"id":"PAY-P3D8HAIDA4QG","status":"WAITING","delayCapture":false,"amount":{"total":4000,"gross":4000,"fees":0,"refunds":0,"liquid":4000,"currency":"BRL"},"installmentCount":1,"fundingInstrument":{"boleto":{"expirationDate":"2017-09-30","lineCode":"23793.39126 60000.123798 57001.747906 8 72980000004000","logoUri":"http://","instructionLines":{"first":"Primeira linha se instrução","second":"Segunda linha se instrução","third":"Terceira linha se instrução"}},"method":"BOLETO"},"fees":[{"type":"TRANSACTION","amount":0}],"events":[{"type":"PAYMENT.CREATED","createdAt":"2017-08-25T14:21:18.000-03"},{"type":"PAYMENT.WAITING","createdAt":"2017-08-25T14:21:18.000-03"}],"receivers":[{"moipAccount":{"id":"MPA-123123123","login":"test@moip.com.br","fullname":"Test Moip"},"type":"PRIMARY","amount":{"total":4000,"refunds":0}}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-P3D8HAIDA4QG"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-B3BOEUI4S2J9","title":"ORD-B3BOEUI4S2J9"}},"createdAt":"2017-08-25T14:21:18.000-03","updatedAt":"2017-08-25T14:21:18.000-03"}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/multipayments/MPY-VVVF0YDCY15H"},"multiorder":{"href":"https://sandbox.moip.com.br/v2/multiorders/MOR-F2R675R1X97P"},"checkout":{"payBoleto":{"redirectHref":"https://checkout-sandbox.moip.com.br/boleto/MPY-VVVF0YDCY15H"}}}}