src/test/resources/plays/multipayment/create_escrow.yaml

!play
interactions:
-
  request:
    uri: /v2/multiorders/MOR-T1F8O64DLS4X/multipayments
    headers:
      "Content-Type": application/json
      Authorization: Basic MDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDE6QUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQg==
    method: POST
  response:
    status: 200
    headers:
      "Content-Type": application/json
    body: |
      {"id":"MPY-TUZUG6A4AHLF","status":"WAITING","amount":{"total":8000,"currency":"BRL"},"installmentCount":1,"payments":[{"id":"PAY-0NBSP8T2ZQ0F","status":"WAITING","delayCapture":false,"amount":{"total":4000,"gross":4000,"fees":0,"refunds":0,"liquid":4000,"currency":"BRL"},"installmentCount":1,"fundingInstrument":{"creditCard":{"id":"CRC-P6OTZ6WL2L2K","brand":"MASTERCARD","first6":"555566","last4":"8884","store":true,"holder":{"birthdate":"1988-12-30","birthDate":"1988-12-30","taxDocument":{"type":"CPF","number":"33333333333"},"fullname":"Jose Portador da Silva"}},"method":"CREDIT_CARD"},"fees":[{"type":"TRANSACTION","amount":0}],"escrows":[{"id":"ECW-RI6HTOU2M4DY","status":"HOLD_PENDING","description":"Custódia de pagamento","amount":4000,"createdAt":"2017-12-27T11:24:27.000-02","updatedAt":"2017-12-27T11:24:27.000-02","_links":{"self":{"href":"https://sandbox.moip.com.br/v2/escrows/ECW-RI6HTOU2M4DY"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-4POVRHM3NW2C","title":"ORD-4POVRHM3NW2C"},"payment":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-0NBSP8T2ZQ0F","title":"PAY-0NBSP8T2ZQ0F"}}}],"events":[{"type":"PAYMENT.CREATED","createdAt":"2017-12-27T11:24:27.000-02"},{"type":"PAYMENT.WAITING","createdAt":"2017-12-27T11:24:27.000-02"}],"receivers":[{"moipAccount":{"id":"MPA-VB5OGTVPCI52","login":"lojista_1@labs.moip.com.br","fullname":"Chris Coyier Moip"},"type":"PRIMARY","amount":{"total":4000,"currency":"BRL","fees":0,"refunds":0},"feePayor":true}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-0NBSP8T2ZQ0F"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-4POVRHM3NW2C","title":"ORD-4POVRHM3NW2C"}},"createdAt":"2017-12-27T11:24:27.000-02","updatedAt":"2017-12-27T11:24:27.000-02"},{"id":"PAY-90U6J0J1UJWH","status":"WAITING","delayCapture":false,"amount":{"total":4000,"gross":4000,"fees":0,"refunds":0,"liquid":4000,"currency":"BRL"},"installmentCount":1,"fundingInstrument":{"creditCard":{"id":"CRC-M0SW763ZEXNW","brand":"MASTERCARD","first6":"555566","last4":"8884","store":true,"holder":{"birthdate":"1988-12-30","birthDate":"1988-12-30","taxDocument":{"type":"CPF","number":"33333333333"},"fullname":"Jose Portador da Silva"}},"method":"CREDIT_CARD"},"fees":[{"type":"TRANSACTION","amount":0}],"escrows":[{"id":"ECW-6WXJ5RGVG83Y","status":"HOLD_PENDING","description":"Custódia de pagamento","amount":4000,"createdAt":"2017-12-27T11:24:27.000-02","updatedAt":"2017-12-27T11:24:27.000-02","_links":{"self":{"href":"https://sandbox.moip.com.br/v2/escrows/ECW-6WXJ5RGVG83Y"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-KNPET7RLSEEI","title":"ORD-KNPET7RLSEEI"},"payment":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-90U6J0J1UJWH","title":"PAY-90U6J0J1UJWH"}}}],"events":[{"type":"PAYMENT.CREATED","createdAt":"2017-12-27T11:24:27.000-02"},{"type":"PAYMENT.WAITING","createdAt":"2017-12-27T11:24:27.000-02"}],"receivers":[{"moipAccount":{"id":"MPA-IFYRB1HBL73Z","login":"lojista_3@labs.moip.com.br","fullname":"Lojista 3 Moip"},"type":"PRIMARY","amount":{"total":3945,"currency":"BRL","fees":0,"refunds":0},"feePayor":true},{"moipAccount":{"id":"MPA-KQB1QFWS6QNM","login":"secundario_1@labs.moip.com.br","fullname":"Maria da Silva Santos"},"type":"SECONDARY","amount":{"total":55,"currency":"BRL","fees":0,"refunds":0},"feePayor":false}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-90U6J0J1UJWH"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-KNPET7RLSEEI","title":"ORD-KNPET7RLSEEI"}},"createdAt":"2017-12-27T11:24:27.000-02","updatedAt":"2017-12-27T11:24:27.000-02"}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/multipayments/MPY-TUZUG6A4AHLF"},"multiorder":{"href":"https://sandbox.moip.com.br/v2/multiorders/MOR-T1F8O64DLS4X"}}}